In [33]:
import pandas as pd

In [34]:
df1 = pd.DataFrame({"name":["Kyle","Erin"],"number":[1234,5678]})

In [35]:
df2 = pd.DataFrame(
    columns = ["A","B","C"],
    data = [
        [1,2,3],
        [4,5,6],
        [7,8,9]],
)
df2 = df2.set_index(["A"]);

In [36]:
display(df1,df2)

   name  number
0  Kyle    1234
1  Erin    5678

   B  C
A
1  2  3
4  5  6
7  8  9

In [37]:
irisdf = pd.read_csv("iris.data",names=["Sepal Length","Sepal Width","Petal Length","Petal Width","Class"])

In [38]:
irisdf

     Sepal Length  Sepal Width  Petal Length  Petal Width           Class
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [39]:
irisdf.to_csv("temp.csv",index = False)

In [45]:
untidy_phone = pd.DataFrame({"names":["Kyle","Erin","Catherine","Claire"],
                             "MobileNumber":[4,1,2,1],
                             "HomeNumber":[6,3,5,None]}
                           )
untidy_phone.melt(id_vars=["names"],var_name="PhoneType",value_name="PhoneNumber")

       names     PhoneType  PhoneNumber
0       Kyle  MobileNumber          4.0
1       Erin  MobileNumber          1.0
2  Catherine  MobileNumber          2.0
3     Claire  MobileNumber          1.0
4       Kyle    HomeNumber          6.0
5       Erin    HomeNumber          3.0
6  Catherine    HomeNumber          5.0
7     Claire    HomeNumber          NaN

In [48]:
df3 = df2.assign(D=df2.B*df2.C)

In [52]:
# OR
df3['E'] = df2.B*df2.C

In [53]:
df1

   name  number
0  Kyle    1234
1  Erin    5678

In [62]:
df1 = df1.append(pd.DataFrame({"name":["Catherine"], "number":[5423]}),ignore_index=True)

In [64]:
df1[['name','number']]
# You have to use [[two brackets]] to get a DataFrame, if you type df1.name you get a series

        name  number
0       Kyle    1234
1       Erin    5678
2  Catherine    5423